Update occupancy sensor documentation
